const multiIndex = [3, 0]
const multiArray = [
  ['异地（非深圳、临桂、柳江）','前海分行', '总行营业部','罗湖支行','盐田支行','上步支行','福田支行','车公庙支行', '南山支行', '宝安支行','龙城支行','西乡支行','福永支行','沙井支行','松岗支行','燕罗支行','龙华支行','石岩支行','观澜支行','公明支行','光明支行','布吉支行','坂田支行','平湖支行','横岗支行','龙岗支行','坪山支行','坪地支行','大鹏支行','临桂支行','柳江支行'], 
  ['罗湖支行营业部','金稻田支行','罗芳支行']
]
const objectMultiArray = [
  [
    {
      id: 0,
      name: ''
    }
  ],[
    {
      id: 0,
      name: ''
    }
  ],[
    {
      id: 0,
      name: ''
    }
  ],[
    {
      id: 0,
      name: '罗湖支行营业部'
    },
    {
      id: 1,
      name: '金稻田支行'
    },
    {
      id: 2,
      name: '罗芳支行'
    }
  ],[
    {
      id: 0,
      name: '盐田支行营业部'
    },
    {
      id: 1,
      name: '盐港支行'
    }
  ],[
    {
      id: 0,
      name: '上步支行营业部'
    },
    {
      id: 1,
      name: '大望支行'
    },
    {
      id: 2,
      name: '南园支行'
    },
    {
      id: 3,
      name: '泥岗支行'
    }
  ],[
    {
      id: 0,
      name: '福田支行营业部'
    },
    {
      id: 1,
      name: '梅林支行'
    },
    {
      id: 2,
      name: '岗厦支行'
    },
    {
      id: 3,
      name: '渔农支行'
    }
  ]
]

const handleColumnchange = (index) => {
  let data = null
  switch (index) {
    case 0:
      data = [''];
      return data
      break;
    case 1:
      data = [''];
      return data
      break;
    case 2:
      data = [''];
      return data
      break;
    case 3:
      data = ['罗湖支行营业部','金稻田支行','罗芳支行'];
      return data
      break;
    case 4:
      data = ['盐田支行营业部','盐港支行'];
      return data
      break;
    case 5:
      data = ['上步支行营业部','大望支行','南园支行','泥岗支行'];
      return data
      break;
    case 6:
      data = ['福田支行营业部','梅林支行','岗厦支行','渔农支行'];
      return data
      break;
    case 7:
      data = ['车公庙支行营业部','上沙支行','竹子林支行','科技园支行'];
      return data
      break;
    case 8:
      data = ['南山支行营业部','海湾支行','西丽支行','大学城支行','南头支行'];
      return data
      break;
    case 9:
      data = ['宝安支行营业部','上合支行','翻身支行','安乐支行','宝城支行','开屏支行','创业支行'];
      return data
      break;
    case 10:
      data = ['龙城支行营业部','新城支行','南联支行','回龙埔支行','和兴支行','盛平支行'];
      return data
      break;
    case 11:
      data = ['西乡支行营业部','劳动支行','三联支行','宝田支行','固戍支行','碧海湾支行','共乐支行','黄田支行','宝源支行','荔园支行'];
      return data
      break;
    case 12:
      data = ['福永支行营业部','新和支行','桥头支行','和平支行','凤凰支行','福围支行','福星支行','塘尾支行','兴围支行','白石厦支行','怀德公元支行'];
      return data
      break;
    case 13:
      data = ['沙井支行营业部','东塘支行','蚝景支行','黄埔支行','衙边支行','万丰支行','上星支行','坣岗支行','丽沙支行','沙头支行','沙蚝支行','福和支行','新桥支行','新二支行（与新桥支行合并办公）'];
      return data
      break;
    case 14:
      data = ['松岗支行营业部','松涛支行','潭头支行','东方支行','江围支行','沙溪支行','红星支行'];
      return data
      break;
    case 15:
      data = ['燕罗支行营业部','罗田支行','塘下冲支行','楼岗支行（与松岗支行合并办公）'];
      return data
      break;
    case 16:
      data = ['龙华支行营业部','胜龙支行','人民路支行','上塘支行','民治支行','大浪支行','花园支行','民乐支行','清湖支行','和平路支行','北站支行'];
      return data
      break;
    case 17:
      data = ['石岩支行营业部','罗租支行（与上屋支行合并办公）','上屋支行','水田支行','官田支行','塘头支行','应人石支行'];
      return data
      break;
    case 18:
      data = ['观澜支行营业部','牛湖支行','樟坑径支行','新澜支行','章阁支行','福民支行','松元支行','新田支行','库坑支行','大水坑支行'];
      return data
      break;
    case 19:
      data = ['公明支行营业部','玉律支行','长圳支行','将石支行','李松朗支行','下村支行','马田支行','合水口支行','上村支行','田寮支行'];
      return data
      break;
    case 20:
      data = ['光明支行营业部','楼村支行','高墩支行','东坑支行','圳美支行'];
      return data
      break;
    case 21:
      data = ['布吉支行营业部','水径支行','南岭支行','李朗支行','南湾支行','沙西支行','吉华支行','大芬支行','吉信支行'];
      return data
      break;
    case 22:
      data = ['坂田支行营业部','雪象支行（与坂田支行合并办公）','五和支行','岗头支行','扬马支行'];
      return data
      break;
    case 23:
      data = ['平湖支行营业部','新木支行','凤凰湖支行','鹅公岭支行','良安田支行','白泥坑支行','山厦支行','辅城坳支行'];
      return data
      break;
    case 24:
      data = ['横岗支行营业部','红棉路支行','西坑支行','大康支行','六约支行','黄阁坑支行','荷坳支行','四联支行','安良支行'];
      return data
      break;
    case 25:
      data = ['龙岗支行营业部','鹏达支行','工业区支行','福宁支行','南约支行','同乐支行','五联支行','龙西支行','龙东支行','新生支行','大和支行'];
      return data
      break;
    case 26:
      data = ['坪山支行营业部','田坑支行','大工业区支行','石井支行','沙坣支行','六联支行','汤坑支行','碧岭支行','东门支行','坑梓支行','老坑支行','龙田支行','秀新支行','金沙支行','沙田支行'];
      return data
      break;
    case 27:
      data = ['坪地支行营业部','坪惠支行','坪西支行','坪东支行','富民支行','年丰支行'];
      return data
      break;
    case 28:
      data = ['大鹏支行营业部','王母街支行（与大鹏支行合并办公）','鹏城支行','水头支行（与大鹏支行合署办公）','南澳支行','东山支行（与新大支行合署办公）','新大支行','东冲支行（与西冲支行合并办公）','西冲支行','葵涌支行','墟镇支行（与葵涌支行合署办公）','土洋支行','溪涌支行'];
      return data
      break;
    case 29:
      data = ['临桂支行营业部','朝阳支行','同心分理处'];
      return data
      break;
    case 30:
      data = ['柳江支行营业部','基隆支行','潭中东路分理处','银桐分理处','柳州跃进路分理处'];
      return data
      break;
  }
}

module.exports = {
  multiArray,
  multiIndex,
  objectMultiArray,
  handleColumnchange
}
  